

railway_lines = [
    ("Київ", "Коростень"), ("Коростень", "Звягель"), ("Звягель", "Шепетівка"), ("Шепетівка", "Здолбунів"), ("Здолбунів", "Львів"),
    ("Ковель", "Сарни"), ("Сарни", "Коростень"), ("Коростень", "Київ"),
    ("Київ", "Фастів"), ("Фастів", "Козятин"), ("Козятин", "Здолбунів"), ("Здолбунів", "Львів"),
    ("Жмеринка", "Хмельницький"), ("Хмельницький", "Тернопіль"), ("Тернопіль", "Красне"), ("Красне", "Львів"),
    ("Козятин", "Жмеринка"), ("Жмеринка", "Одеса"),
    ("Львів", "Івано-Франківськ"), ("Івано-Франківськ", "Рахів"), ("Рахів", "Коломия"), ("Коломия", "Чернівці"),
    ("Київ", "Конотоп"), ("Конотоп", "Шостка"),
    ("Київ", "Полтава"), ("Полтава", "Харків"),
    ("Фастів", "Біла Церква"), ("Біла Церква", "Сміла"), ("Сміла", "Дніпро"),
    ("Кривий Ріг", "Дніпро"), ("Дніпро", "Запоріжжя"),
    ("Харків", "Дніпро"), ("Дніпро", "Запоріжжя"), ("Запоріжжя", "Мелітополь"), ("Мелітополь", "Новоолексіївка"),
    ("Львів", "Мукачево"), ("Мукачево", "Чоп")
]
# the distances between cities do not correspond to reality
railway_lines_with_dist = [
    ("Київ", "Коростень", 150), ("Коростень", "Звягель", 200), ("Звягель", "Шепетівка", 300), ("Шепетівка", "Здолбунів", 150), ("Здолбунів", "Львів", 333),
    ("Ковель", "Сарни", 170), ("Сарни", "Коростень", 200), ("Коростень", "Київ", 230),
    ("Київ", "Фастів", 220), ("Фастів", "Козятин", 330), ("Козятин", "Здолбунів", 142), ("Здолбунів", "Львів", 120),
    ("Жмеринка", "Хмельницький", 100), ("Хмельницький", "Тернопіль", 150), ("Тернопіль", "Красне", 123), ("Красне", "Львів", 115),
    ("Козятин", "Жмеринка", 230), ("Жмеринка", "Одеса",170),
    ("Львів", "Івано-Франківськ" , 210), ("Івано-Франківськ", "Рахів", 234), ("Рахів", "Коломия", 170), ("Коломия", "Чернівці", 123),
    ("Київ", "Конотоп", 333), ("Конотоп", "Шостка", 270),
    ("Київ", "Полтава", 400), ("Полтава", "Харків", 200),
    ("Фастів", "Біла Церква", 150), ("Біла Церква", "Сміла", 230), ("Сміла", "Дніпро", 123),
    ("Кривий Ріг", "Дніпро", 123), ("Дніпро", "Запоріжжя", 333),
    ("Харків", "Дніпро", 123), ("Дніпро", "Запоріжжя", 322), ("Запоріжжя", "Мелітополь", 33), ("Мелітополь", "Новоолексіївка", 111),
    ("Львів", "Мукачево", 200), ("Мукачево", "Чоп", 300)
]