

railway_lines = [
    ("Київ", "Коростень"), ("Коростень", "Звягель"), ("Звягель", "Шепетівка"), ("Шепетівка", "Здолбунів"), ("Здолбунів", "Львів"),
    ("Ковель", "Сарни"), ("Сарни", "Коростень"), ("Коростень", "Київ"),
    ("Київ", "Фастів"), ("Фастів", "Козятин"), ("Козятин", "Здолбунів"), ("Здолбунів", "Львів"),
    ("Жмеринка", "Хмельницький"), ("Хмельницький", "Тернопіль"), ("Тернопіль", "Красне"), ("Красне", "Львів"),
    ("Козятин", "Жмеринка"), ("Жмеринка", "Одеса"),
    ("Львів", "Івано-Франківськ"), ("Івано-Франківськ", "Рахів"), ("Рахів", "Коломия"), ("Коломия", "Чернівці"),
    ("Київ", "Конотоп"), ("Конотоп", "Шостка"),
    ("Київ", "Полтава"), ("Полтава", "Харків"),
    ("Фастів", "Біла Церква"), ("Біла Церква", "Сміла"), ("Сміла", "Дніпро"),
    ("Кривий Ріг", "Дніпро"), ("Дніпро", "Запоріжжя"),
    ("Харків", "Дніпро"), ("Дніпро", "Запоріжжя"), ("Запоріжжя", "Мелітополь"), ("Мелітополь", "Новоолексіївка"),
    ("Львів", "Мукачево"), ("Мукачево", "Чоп")
]